{
 "welcome": "Welcome to my portfolio",
 "aboutMe": "About Me",
 "contact": "Contact",
 "projectsPage": "Projects",
 "loading": "Loading...",
 "home": "Home",
 "about": "About",
 "footerText": "All rights reserved",
 "themeToggle": "Theme Toggle",
 "homeTitle": "Starting on a New Key: From Music to Coding",
 "homeDescription": "I am Olesia Kubska, a passionate Full Stack Developer dedicated to building and optimizing interactive, user-friendly, and feature-rich websites.",
 "viewWork": "View My Work",
 "contactMe": "Contact Me",
 "downloadResume": "Download Resume",
 "aboutMeTitle": "About Me",
 "aboutDescription": "I am a dedicated Junior Full Stack Developer with two years of focused experience in backend technologies and modern frameworks such as Node, React, Angular, and SQL. Having transitioned from a background in music and arts, I bring a unique blend of creativity and technical skills to my work in developing robust backend solutions and dynamic front-end interfaces. I am currently enrolled in English courses to improve my speaking skills, aiming to achieve a solid C1 level. While I currently have a basic A2 level of English, I am continuously working to improve my communication skills. I am actively seeking a full-time position where I can leverage my backend development skills and continue to grow within modern web technologies. Known for my relentless curiosity and commitment to continual learning, I am eager to deepen my expertise and contribute to innovative projects.",
 "techSkills": "Tech Skills",
 "softSkills": "Soft Skills",
 "languages": "Languages",
 "workExperience": "Work Experience",
 "education": "Education",
 "softSkillItems": {
  "organized": "Organized",
  "teamwork": "Teamwork",
  "communication": "Communication",
  "creative": "Creative",
  "decisionMaking": "Decision-making",
  "abilityToLearn": "Ability to Learn",
  "timeManagement": "Time Management"
 },
 "languagesList": {
  "ukrainian": "Ukrainian - Native",
  "russian": "Russian - Fluent",
  "english": "English - Intermediate",
  "polish": "Polish - Advanced (B2 Certificate)"
 },
 "educationTitle": "Education",
 "bialystokUniversity": "Bialystok University of Technology | Poland",
 "jsDeveloperCourse": "“JavaScript Developer” | October 2023 - July 2024",
 "golTSchool": "IT School GolT | Ukraine",
 "fullStackCourse": "“Full Stack Developer” | 2023 – 2024 | CERTIFICATE",
 "dragomanovUniversityManagement": "National Pedagogical Dragomanov University | Ukraine",
 "managementCourse": "“Education institution management” | 2014 – 2016 | MASTER | Business, office and organization manager",
 "dragomanovUniversityMusic": "National Pedagogical Dragomanov University | Ukraine",
 "musicCourse": "“Musical art” | 2010 - 2015 | MASTER | Methods of musical education teacher (lecturer), music teacher and choir master",
 "connect": "Let's connect!",
 "yourName": "Name",
 "yourEmail": "Email",
 "yourMessage": "Message",
 "send": "Send",
 "validation": {
    "nameRequired": "Name is required",
    "emailInvalid": "Invalid email format",
    "emailRequired": "Email is required",
    "messageMin": "Message must be at least 10 characters",
    "messageRequired": "Message is required"
  },
  "form": {
    "success": "Message sent successfully!",
    "error": "Error sending message: ",
    "sending": "Sending..."
  },
  "projects": {
    "water": {
      "title": "WATER TRACKER",
      "stack": "[HTML5, CSS3, JavaScript, React, Redux Toolkit, React Router, Axios, Vite, Node]",
      "description": "This description highlights your role, key contributions, and the technologies you worked with, offering a clear and concise overview of your involvement in the project. This project showcases my ability to develop a user-centric application utilizing modern web technologies and API integration for a seamless user experience. The application utilizes a backend developed by our team. Feel free to familiarize yourself with it here."
    },
    "cinemania": {
      "title": "CINEMANIA",
      "stack": "[JavaScript, HTML5, SCSS, Parcel]",
      "description": "In the project, I played a crucial role in developing and enhancing the catalog-search section. I was responsible for implementing key functionalities using JavaScript and HTML5. Additionally, I took the initiative to optimize and refine the user interface by making corrections to the SCSS and JavaScript codebase. This experience not only improved my technical skills but also honed my problem-solving abilities when dealing with intricate challenges."
    },
    "mimino": {
      "title": "MIMINO HOTEL",
      "stack": "[HTML5, CSS3, JavaScript, Parcel]",
      "description": "Within the project, my primary focus was on designing and developing the restaurant menu section. I leveraged HTML5 and CSS3 to create an appealing and user-friendly interface. Incorporating JavaScript, I implemented interactive features to enhance the overall user experience. This project not only allowed me to enhance my front-end development skills but also provided insights into effective UI/UX design principles."
    }
  }
}
