{
 "welcome": "Witamy w moim portfolio",
 "aboutMe": "O mnie",
 "achievements": "Osiągnięcia",
 "contact": "Kontakt",
 "projectsPage": "Projekty",
 "loading": "Ładowanie...",
 "home": "Strona główna",
 "about": "O mnie",
 "footerText": "Wszystkie prawa zastrzeżone",
 "themeToggle": "Przełącznik motywu",
 "homeTitle": "Zaczynam nowy etap: od muzyki do programowania",
 "homeDescription": "Jestem Olesia Kubska, pasjonatką Full Stack Development, dedykowaną tworzeniu i optymalizacji interaktywnych, przyjaznych dla użytkownika i funkcjonalnych stron internetowych.",
 "viewWork": "Zobacz moje prace",
 "contactMe": "Skontaktuj się ze mną",
 "downloadResume": "Pobierz CV",
 "aboutMeTitle": "O mnie",
 "aboutDescription": "Jestem oddanym Junior Full Stack Developerem z dwuletnim doświadczeniem w technologiach backendowych oraz nowoczesnych frameworkach, takich jak Node, React, Angular i SQL. Przeszedłszy z dziedziny muzyki i sztuki, łączę kreatywność i umiejętności techniczne w pracy nad solidnymi rozwiązaniami backendowymi i dynamicznymi interfejsami front-endowymi. Obecnie uczęszczam na kursy języka angielskiego, aby poprawić swoje umiejętności mówienia, dążąc do poziomu С1. Posiadam podstawowy poziom A2, ale nieustannie pracuję nad poprawą komunikacji. Poszukuję pełnoetatowego stanowiska, które pozwoli mi wykorzystać moje umiejętności w rozwoju backendu i kontynuować rozwój w zakresie nowoczesnych technologii internetowych. Znana jestem z nieustannej ciekawości i chęci do ciągłej nauki, a także z gotowości do angażowania się w innowacyjne projekty.",
 "techSkills": "Umiejętności techniczne",
 "softSkills": "Umiejętności miękkie",
 "languages": "Języki",
 "workExperience": "Doświadczenie zawodowe",
 "education": "Edukacja",
 "softSkillItems": {
  "organized": "Zorganizowana",
  "teamwork": "Praca zespołowa",
  "communication": "Komunikacja",
  "creative": "Kreatywność",
  "decisionMaking": "Podejmowanie decyzji",
  "abilityToLearn": "Zdolność do nauki",
  "timeManagement": "Zarządzanie czasem"
 },
 "languagesList": {
  "ukrainian": "Ukraiński - Język ojczysty",
  "russian": "Rosyjski - Biegła znajomość",
  "english": "Angielski - Średniozaawansowany (Intermediate)",
  "polish": "Polski - Zaawansowany (Certyfikat B2)"
 },
 "educationTitle": "Edukacja",
 "bialystokUniversity": "Politechnika Białostocka | Polska",
 "jsDeveloperCourse": "„JavaScript Developer” | Październik 2023 - Lipiec 2024",
 "golTSchool": "Szkoła IT GolT | Ukraina",
 "fullStackCourse": "„Full Stack Developer” | 2023 – 2024 | CERTYFIKAT",
 "dragomanovUniversityManagement": "Narodowy Uniwersytet Pedagogiczny im. Dragomanowa | Ukraina",
 "managementCourse": "„Zarządzanie placówką edukacyjną” | 2014 – 2016 | MAGISTER | Menedżer biura, biznesu i organizacji",
 "dragomanovUniversityMusic": "Narodowy Uniwersytet Pedagogiczny im. Dragomanowa | Ukraina",
 "musicCourse": "„Sztuka muzyczna” | 2010 - 2015 | MAGISTER | Nauczyciel metodyk edukacji muzycznej, nauczyciel muzyki i dyrygent chóru",
 "connect": "Połączmy się!",
 "yourName": "Imię",
 "yourEmail": "Email",
 "yourMessage": "Wiadomość",
 "send": "Wyślij",
 "validation": {
    "nameRequired": "Imię jest wymagane",
    "emailInvalid": "Nieprawidłowy format email",
    "emailRequired": "Email jest wymagany",
    "messageMin": "Wiadomość musi mieć co najmniej 10 znaków",
    "messageRequired": "Wiadomość jest wymagana"
  },
  "form": {
    "success": "Wiadomość została wysłana pomyślnie!",
    "error": "Błąd podczas wysyłania wiadomości: ",
    "sending": "Wysyłanie..."
  },
  "projects": {
    "water": {
      "title": "ŚLEDZENIE WODY",
      "stack": "[HTML5, CSS3, JavaScript, React, Redux Toolkit, React Router, Axios, Vite, Node]",
      "description": "Ten opis podkreśla Twoją rolę, kluczowy wkład oraz technologie, z których korzystałeś, oferując jasny i zwięzły przegląd Twojego udziału w projekcie. Projekt ten pokazuje moją umiejętność tworzenia aplikacji zorientowanej na użytkownika z wykorzystaniem nowoczesnych technologii internetowych i integracji API w celu zapewnienia płynnego doświadczenia użytkownika. Aplikacja korzysta z backendu opracowanego przez nasz zespół. Zapraszam do zapoznania się z nim tutaj."
    },
    "cinemania": {
      "title": "CINEMANIA",
      "stack": "[JavaScript, HTML5, SCSS, Parcel]",
      "description": "W projekcie odegrałam kluczową rolę w tworzeniu i ulepszaniu sekcji wyszukiwania w katalogu. Byłam odpowiedzialna za wdrażanie najważniejszych funkcjonalności przy użyciu JavaScript i HTML5. Ponadto podjęłam inicjatywę optymalizacji i udoskonalenia interfejsu użytkownika poprzez poprawki w kodzie SCSS i JavaScript. Doświadczenie to nie tylko poprawiło moje umiejętności techniczne, ale także rozwinęło zdolności do rozwiązywania złożonych problemów."
    },
    "mimino": {
      "title": "MIMINO HOTEL",
      "stack": "[HTML5, CSS3, JavaScript, Parcel]",
      "description": "W tym projekcie skoncentrowałam się głównie na zaprojektowaniu i opracowaniu sekcji menu restauracyjnego. Wykorzystałam HTML5 i CSS3 do stworzenia atrakcyjnego i przyjaznego dla użytkownika interfejsu. Dzięki JavaScript wdrożyłam funkcje interaktywne, aby poprawić ogólne wrażenia użytkownika. Projekt ten pozwolił mi rozwijać umiejętności w zakresie frontendu oraz zrozumieć zasady skutecznego projektowania UI/UX."
    },
    "webstudio": {
      "title": "WEBSTUDIO",
      "stack": "[HTML5, CSS3, JavaScript]",
      "description": "WEBSTUDIO był projektem edukacyjnym, który umożliwił mi zastosowanie i utrwalenie wiedzy z zakresu HTML5 i CSS3. Dzięki temu projektowi zdobyłam praktyczne doświadczenie w tworzeniu responsywnych i atrakcyjnych wizualnie stron internetowych. Projekt ten stanowił fundament w rozwijaniu moich umiejętności web developerskich oraz zrozumieniu podstaw tworzenia angażujących treści online."
    },
    "teamTitle": "Projekty zespołowe",
    "personalTitle": "Moje projekty"
  },
  "buttons": {
    "team": "Zespół",
    "personal": "Osobisty"
  }
}
